IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_IEP1.xml
	<register id="PR1_IEP1__SLV__REGS_rxipg1_reg" acronym="PR1_IEP1__SLV__REGS_rxipg1_reg" offset="0xBC" width="32" description="">
		<bitfield id="RX_MIN_IPG1" width="16" begin="31" end="16" resetval="0x65535" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_IPG1" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp8_reg0" acronym="PR1_IEP1__SLV__REGS_cmp8_reg0" offset="0xC0" width="32" description="">
		<bitfield id="CMP8_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp8_reg1" acronym="PR1_IEP1__SLV__REGS_cmp8_reg1" offset="0xC4" width="32" description="">
		<bitfield id="CMP8_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp9_reg0" acronym="PR1_IEP1__SLV__REGS_cmp9_reg0" offset="0xC8" width="32" description="">
		<bitfield id="CMP9_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp9_reg1" acronym="PR1_IEP1__SLV__REGS_cmp9_reg1" offset="0xCC" width="32" description="">
		<bitfield id="CMP9_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp10_reg0" acronym="PR1_IEP1__SLV__REGS_cmp10_reg0" offset="0xD0" width="32" description="">
		<bitfield id="CMP10_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp10_reg1" acronym="PR1_IEP1__SLV__REGS_cmp10_reg1" offset="0xD4" width="32" description="">
		<bitfield id="CMP10_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp11_reg0" acronym="PR1_IEP1__SLV__REGS_cmp11_reg0" offset="0xD8" width="32" description="">
		<bitfield id="CMP11_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp11_reg1" acronym="PR1_IEP1__SLV__REGS_cmp11_reg1" offset="0xDC" width="32" description="">
		<bitfield id="CMP11_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp12_reg0" acronym="PR1_IEP1__SLV__REGS_cmp12_reg0" offset="0xE0" width="32" description="">
		<bitfield id="CMP12_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp12_reg1" acronym="PR1_IEP1__SLV__REGS_cmp12_reg1" offset="0xE4" width="32" description="">
		<bitfield id="CMP12_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp13_reg0" acronym="PR1_IEP1__SLV__REGS_cmp13_reg0" offset="0xE8" width="32" description="">
		<bitfield id="CMP13_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp13_reg1" acronym="PR1_IEP1__SLV__REGS_cmp13_reg1" offset="0xEC" width="32" description="">
		<bitfield id="CMP13_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp14_reg0" acronym="PR1_IEP1__SLV__REGS_cmp14_reg0" offset="0xF0" width="32" description="">
		<bitfield id="CMP14_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp14_reg1" acronym="PR1_IEP1__SLV__REGS_cmp14_reg1" offset="0xF4" width="32" description="">
		<bitfield id="CMP14_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp15_reg0" acronym="PR1_IEP1__SLV__REGS_cmp15_reg0" offset="0xF8" width="32" description="">
		<bitfield id="CMP15_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp15_reg1" acronym="PR1_IEP1__SLV__REGS_cmp15_reg1" offset="0xFC" width="32" description="">
		<bitfield id="CMP15_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_count_reset_val_reg0" acronym="PR1_IEP1__SLV__REGS_count_reset_val_reg0" offset="0x100" width="32" description="">
		<bitfield id="RESET_VAL_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_count_reset_val_reg1" acronym="PR1_IEP1__SLV__REGS_count_reset_val_reg1" offset="0x104" width="32" description="">
		<bitfield id="RESET_VAL_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_pwm_reg" acronym="PR1_IEP1__SLV__REGS_pwm_reg" offset="0x108" width="32" description="">
		<bitfield id="PWM3_HIT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="PWM3_RST_CNT_EN" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PWM0_HIT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PWM0_RST_CNT_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr0_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr0_bi_reg0" offset="0x10C" width="32" description="">
		<bitfield id="CAPR0_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr0_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr0_bi_reg1" offset="0x110" width="32" description="">
		<bitfield id="CAPR0_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
