IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_IEP1.xml
	<register id="PR1_IEP1__SLV__REGS_capr1_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr1_bi_reg0" offset="0x114" width="32" description="">
		<bitfield id="CAPR1_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr1_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr1_bi_reg1" offset="0x118" width="32" description="">
		<bitfield id="CAPR1_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr2_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr2_bi_reg0" offset="0x11C" width="32" description="">
		<bitfield id="CAPR2_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr2_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr2_bi_reg1" offset="0x120" width="32" description="">
		<bitfield id="CAPR2_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr3_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr3_bi_reg0" offset="0x124" width="32" description="">
		<bitfield id="CAPR3_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr3_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr3_bi_reg1" offset="0x128" width="32" description="">
		<bitfield id="CAPR3_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr4_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr4_bi_reg0" offset="0x12C" width="32" description="">
		<bitfield id="CAPR4_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr4_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr4_bi_reg1" offset="0x130" width="32" description="">
		<bitfield id="CAPR4_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr5_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr5_bi_reg0" offset="0x134" width="32" description="">
		<bitfield id="CAPR5_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr5_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr5_bi_reg1" offset="0x138" width="32" description="">
		<bitfield id="CAPR5_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr6_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr6_bi_reg0" offset="0x13C" width="32" description="">
		<bitfield id="CAPR6_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr6_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr6_bi_reg1" offset="0x140" width="32" description="">
		<bitfield id="CAPR6_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf6_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capf6_bi_reg0" offset="0x144" width="32" description="">
		<bitfield id="CAPF6_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf6_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capf6_bi_reg1" offset="0x148" width="32" description="">
		<bitfield id="CAPF6_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr7_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capr7_bi_reg0" offset="0x14C" width="32" description="">
		<bitfield id="CAPR7_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr7_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capr7_bi_reg1" offset="0x150" width="32" description="">
		<bitfield id="CAPR7_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf7_bi_reg0" acronym="PR1_IEP1__SLV__REGS_capf7_bi_reg0" offset="0x154" width="32" description="">
		<bitfield id="CAPF7_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf7_bi_reg1" acronym="PR1_IEP1__SLV__REGS_capf7_bi_reg1" offset="0x158" width="32" description="">
		<bitfield id="CAPF7_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync_ctrl_reg" acronym="PR1_IEP1__SLV__REGS_sync_ctrl_reg" offset="0x180" width="32" description="">
		<bitfield id="SYNC1_OUT_NV_EN" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/> 
		<bitfield id="SYNC0_OUT_NV_EN" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="SYNC1_IND_EN" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="SYNC1_CYCLIC_EN" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="SYNC1_ACK_EN" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="SYNC0_CYCLIC_EN" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="SYNC0_ACK_EN" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="SYNC1_EN" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="SYNC0_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="SYNC_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync_first_stat_reg" acronym="PR1_IEP1__SLV__REGS_sync_first_stat_reg" offset="0x184" width="32" description="">
		<bitfield id="FIRST_SYNC1" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="FIRST_SYNC0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync0_stat_reg" acronym="PR1_IEP1__SLV__REGS_sync0_stat_reg" offset="0x188" width="32" description="">
		<bitfield id="SYNC0_PEND" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync1_stat_reg" acronym="PR1_IEP1__SLV__REGS_sync1_stat_reg" offset="0x18C" width="32" description="">
		<bitfield id="SYNC1_PEND" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync_pwidth_reg" acronym="PR1_IEP1__SLV__REGS_sync_pwidth_reg" offset="0x190" width="32" description="">
		<bitfield id="SYNC_HPW" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
